;フラッシュストッパー？用のテーブルを新設します
TABLE_DAMAGE_TO_1X_FLASH:
	.db 20 ;00シュリンク
	.db 20 ;シュリンク？
	.db  0 ;
	.db  0 ;
	.db 20 ;M-445
	.db  0 ;
	.db 20 ;撃破爆発(なぜかダメージ指定がある)
	.db  0 ;

	.db 20 ;クロウ
	.db  0 ;
	.db 10 ;タニッシー
	.db 20 ;タニッシーの殻
	.db  5 ;ケロッグ
	.db 20 ;子ケロッグ
	.db  0 ;
	.db  3 ;アンコ

	.db  0 ;10
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db 20 ;バットン
	.db  7 ;ロビット

	.db  0 ;
	.db  3 ;フレンダー
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db 10 ;モンキング
	.db  0 ;
	.db 20 ;クック

	.db  0 ;20
	.db  0 ;
	.db 20 ;テリー
	.db 20 ;チャンキーメーカー
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;

	.db  0 ;
	.db 10 ;ピエロボットのギア
	.db 20 ;ピエロボットの本体
	.db  0 ;
	.db 10 ;フライボーイ
	.db  0 ;
	.db  0 ;
	.db  0 ;

	.db  0 ;30プレス
	.db 20 ;ブロッキー
	.db  0 ;
	.db  0 ;
	.db 20 ;メットール
	.db  0 ;
	.db  7 ;マタサブロウ
	.db  0 ;

	.db 20 ;ピピ
	.db  0 ;
	.db 20 ;ピピのタマゴ
	.db 20 ;ピピの卵の殻(なぜかダメージ指定がある)
	.db 20 ;子ピピ
	.db  7 ;カミナリゴロー(本体)
	.db  0 ;
	.db  0 ;

	.db  0 ;40
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db 20 ;プチゴブリン
	.db 10 ;スプリンガー
	.db  0 ;

	.db 10 ;モール
	.db 10 ;モール
	.db  0 ;
	.db  7 ;ショットマン
	.db  7 ;ショットマン
	.db  0 ;
	.db  4 ;スナイパーアーマー
	.db  7 ;スナイパージョー

	.db  7 ;50スクワームのジェネレータ
	.db 20 ;スクワーム
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;

	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;

	.db  0 ;60
	.db  0 ;リーフシールド
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;

	.db  0 ;
	.db  0 ;
	.db 10 ;ピコピコ
	.db  0 ;
	.db  0 ;
	.db 10 ;ブービーム
	.db  0 ;
	.db  0 ;

	.db  0 ;70
	.db 20 ;ビッグフィッシュ
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;
	.db  0 ;

